20233332choi/DJY_EvTLMT/firmware/esp32_ev_gateway/src/main.cpp
#include <Arduino.h>
#include <HTTPClient.h>
#include <WiFi.h>
#include <WiFiClientSecure.h>
#include <WiFiUdp.h>
#include <esp32-hal-rgb-led.h>
#include <driver/twai.h>
#include <lwip/sockets.h>
#include <time.h>
#include <esp_system.h>

#include "config.h"
#include "djy_can_protocol.h"
#include "djy_uart_protocol.h"
#include "djy_telemetry_protocol.h"
#include "letsencrypt_gen_y.h"
#include "rear_uart_line.h"
#include "rear_timing.h"
#include "telemetry_queue.h"
#include "telemetry_columns.h"
#if EV_RELAY_FAST_RSA_TLS
#include "ngrok_tls_client.h"
#endif
#if EV_TLS_DIAGNOSTICS_ONCE
#include "relay_tls_diagnostics.h"
#endif

#ifndef EV_REAR_UART_MODE
#define EV_REAR_UART_MODE 0
#endif

// Default matches workspace stm_back. Set 0 only for the archived ASCII firmware.
#ifndef EV_REAR_UART_BINARY
#define EV_REAR_UART_BINARY 1
#endif

#ifndef EV_REAR_UART_RX_GPIO
#define EV_REAR_UART_RX_GPIO 18
#endif

#ifndef EV_REAR_UART_TX_GPIO
#define EV_REAR_UART_TX_GPIO 17
#endif

#ifndef EV_BMS_CAN_ENABLED
#define EV_BMS_CAN_ENABLED 0
#endif

#ifndef EV_BMS_CAN_TX_GPIO
#define EV_BMS_CAN_TX_GPIO 9
#endif

#ifndef EV_BMS_CAN_RX_GPIO
#define EV_BMS_CAN_RX_GPIO 8
#endif

#if EV_BMS_CAN_ENABLED && !EV_REAR_UART_MODE
#error "DALY BMS CAN shares the ESP TWAI controller; enable it only in Rear UART mode"
#endif

#ifndef EV_LOCAL_UDP_ENABLED
#define EV_LOCAL_UDP_ENABLED 1
#endif

#ifndef EV_RECEIVE_ONLY
#define EV_RECEIVE_ONLY 0
#endif

#ifndef EV_RELAY_ENABLED
#define EV_RELAY_ENABLED 0
#endif

#ifndef EV_RELAY_URL
#define EV_RELAY_URL ""
#endif

#ifndef EV_RELAY_TOKEN
#define EV_RELAY_TOKEN ""
#endif

#ifndef EV_VEHICLE_ID
#define EV_VEHICLE_ID "EV"
#endif

#ifndef EV_RELAY_ALLOW_INSECURE_TLS
#define EV_RELAY_ALLOW_INSECURE_TLS 0
#endif

#ifndef EV_RELAY_ACCEPT_COMMANDS
#define EV_RELAY_ACCEPT_COMMANDS 0
#endif

#ifndef EV_ALLOW_INSECURE_RELAY_COMMANDS
#define EV_ALLOW_INSECURE_RELAY_COMMANDS 0
#endif

#ifndef EV_ALLOW_PLAINTEXT_RELAY
#define EV_ALLOW_PLAINTEXT_RELAY 0
#endif

#ifndef EV_STATUS_LED_ENABLED
#define EV_STATUS_LED_ENABLED 1
#endif

#ifndef EV_STATUS_LED_GPIO
// Some ESP32-S3 DevKitC-1 boards cannot drive the GPIO48 NeoPixel data line
// high enough. Jumper GPIO38 to GPIO48, then drive the RGB LED through GPIO38.
#define EV_STATUS_LED_GPIO 38
#endif

#if EV_RELAY_ENABLED && EV_RELAY_ACCEPT_COMMANDS && EV_RELAY_ALLOW_INSECURE_TLS && !EV_ALLOW_INSECURE_RELAY_COMMANDS
#error "Internet vehicle commands require verified TLS; do not combine command RX with insecure TLS"
#endif

#if EV_RELAY_ENABLED && EV_RELAY_ACCEPT_COMMANDS && EV_ALLOW_PLAINTEXT_RELAY && !EV_ALLOW_INSECURE_RELAY_COMMANDS
#error "Internet vehicle commands require verified TLS; do not combine command RX with plaintext HTTP"
#endif

namespace {

int telemetrySocket = -1;
WiFiUDP commandUdp;
IPAddress pitHost;
bool canReady = false;
bool bmsCanReady = false;
HardwareSerial rearUart(1);
bool rearUartReady = false;
uint32_t wifiLastReconnectMs = 0;
uint32_t wifiReconnectAttempts = 0;
constexpr uint16_t kSasCounts = 16384u;
constexpr uint16_t kSasCenterRaw = 8192u;
constexpr float kSasToSteeringRatio = -0.2f;
constexpr size_t kTelemetryJsonSize = 4096u;

struct VehicleState {
    RearTiming timing;
    bool sasValid = false;
    uint16_t sasCenterRaw = 8192;
    float steeringRad = 0.0f;
    uint32_t sequence = 0;
    uint16_t sasRaw = 0, tpsRaw = 0;
    uint16_t rpmLeft = 0, rpmRight = 0;
    uint32_t captureLeft = 0, captureRight = 0;
    uint32_t glitchLeft = 0, glitchRight = 0;
    uint32_t desyncLeft = 0, desyncRight = 0;
    uint32_t stmCanRx = 0, stmCanErrors = 0, stmCanStatus = 0;
    uint32_t stmImuDiag0 = 0, stmImuDiag1 = 0, stmImuDiag2 = 0, stmImuDiag3 = 0;
    uint16_t dacLeft = 0, dacRight = 0;
    uint8_t tvRequested = 0, regenRequested = 0;
    uint8_t tvApplied = 0, regenApplied = 0;
    uint8_t driveMode = 1, controlFlags = 0, rearFlags = 0, fault = 0;
    uint8_t driverSequence = 0, rearSequence = 0, configSequence = 0;
    uint8_t tvLimit = 100, regenLimit = 0;
    uint16_t tvRamp = 200, regenRamp = 0;
    bool configAck = false;
    bool imuValid = false;
    float yawRateRadS = 0.0f, lateralAccelMS2 = 0.0f, longitudinalAccelMS2 = 0.0f;
    float imuRawAx = 0.0f, imuRawAy = 0.0f, imuRawAz = 0.0f;
    float vehicleSpeedMS = 0.0f, desiredYawRadS = 0.0f, yawErrorRadS = 0.0f;
    float deltaPowerKw = 0.0f, powerLeftKw = 0.0f, powerRightKw = 0.0f;
    float tractionScale = 1.0f;
    float pidKp = 0.0f, pidKi = 0.0f, pidKd = 0.0f;
    uint32_t pidMs = 0;
    bool edActive = false;
    uint32_t rearUartRx = 0, rearUartErrors = 0, rearUartBytes = 0;
    bool rearBinarySeen = false;
    uint32_t rearSampleSequence = 0, rearTxSkipped = 0, rearMissingSamples = 0;
    uint32_t rearDuplicateSamples = 0, rearClockResets = 0;
    uint64_t rearSnapshotUs = 0;
    uint32_t rearRxHigh = 0, rearRxLow = 0;
    bool rpmLeftValid = false, rpmRightValid = false;
    uint32_t rearCommandRx = 0, rearCommandErrors = 0, rearExtendedMs = 0, tqvInternalMs = 0;
    int16_t tpsReportedPct = -1;
    uint32_t sasMs = 0, tpsMs = 0, driverMs = 0, rearMs = 0;
} state;

struct BmsState {
    float voltage = 0.0f, current = 0.0f, soc = 0.0f;
    float maxCell = 0.0f, minCell = 0.0f, maxTemp = 0.0f, minTemp = 0.0f;
    float remainingAh = 0.0f;
    uint16_t maxCellNumber = 0, minCellNumber = 0, cycleCount = 0;
    uint8_t cellCount = 0, tempCount = 0, life = 0;
    uint8_t state = 0;
    bool chargeMos = false, dischargeMos = false, charger = false, load = false, balancing = false;
    uint8_t alarm[8] = {};
    float cells[48] = {};
    bool cellSeen[48] = {};
    uint32_t lastRxMs = 0;
    bool powerSeen = false, powerRequested = false;
    uint32_t powerLastRxMs = 0, powerRxCount = 0;
    uint32_t powerRxIntervalMs = 0, powerMaxRxIntervalMs = 0;
    uint32_t powerLastRequestMs = 0, powerRequestCount = 0;
    uint32_t powerMaxRequestIntervalMs = 0, powerTxErrors = 0;
} bms;

// Voltage/current have their own 10 ms schedule. The remaining eight IDs
// rotate every 100 ms (800 ms per ID), initially offset from power polling.
uint8_t bmsRequestId = 0x91;
uint32_t bmsNextRequestMs = 5;
uint32_t bmsNextPowerRequestMs = 0;

DjyUartLiveTv liveCommand = {};
bool liveCommandSeen = false;
uint32_t liveCommandMs = 0;

bool jsonStringEquals(const String& input, const char* key, const char* expected) {
    const String marker = String('"') + key + "\":";
    int start = input.indexOf(marker);
    if (start < 0) return false;
    start += marker.length();
    while (start < input.length() && input[start] == ' ') ++start;
    if (start >= input.length() || input[start] != '"') return false;
    ++start;
    const int end = input.indexOf('"', start);
    return end >= start && input.substring(start, end) == expected;
}

#if EV_RELAY_ENABLED
portMUX_TYPE relayMux = portMUX_INITIALIZER_UNLOCKED;
// Variable-length rows share 96 KiB instead of reserving 4 KiB per sample.
TelemetryQueue<1536, 256, 96 * 1024> relaySamples;
char relayColumns[3072] = {};
char relayStreamId[17] = {};
constexpr size_t kRelayBatchSize = 64 * 1024;
// Only the header is copied; HTTPClient streams frozen FIFO rows directly.
char relayPrefix[4096] = {};
char relayCommand[512] = {};
bool relayCommandPending = false;
uint32_t relayTxCount = 0;
uint32_t relayLastSuccessMs = 0;
uint32_t relayErrorCount = 0;
uint32_t relayCommandCount = 0;
int relayLastHttpStatus = 0;
int relayDnsStatus = 0;
int relayTcp443Status = 0;
int relayTlsError = 0;

class RelayBody : public Stream {
public:
    RelayBody(const char* prefix, size_t count, size_t arrayLength)
        : prefix_(prefix), prefixLength_(strlen(prefix)), count_(count), arrayLength_(arrayLength) {}
    int available() override { return static_cast<int>(prefixLength_ + arrayLength_ + 1 - position_); }
    size_t readBytes(char* output, size_t length) override {
        size_t used = 0;
        while (used < length && available()) {
            size_t copied = 0;
            if (position_ < prefixLength_) {
                copied = prefixLength_ - position_;
                if (copied > length - used) copied = length - used;
                memcpy(output + used, prefix_ + position_, copied);
            } else if (position_ < prefixLength_ + arrayLength_) {
                copied = relaySamples.readBatch(output + used, position_ - prefixLength_, length - used, count_);
            } else {
                output[used] = '}'; copied = 1;
            }
            if (!copied) break;
            position_ += copied; used += copied;
        }
        return used;
    }
    int read() override { char value; return readBytes(&value, 1) ? static_cast<uint8_t>(value) : -1; }
    int peek() override { const size_t saved = position_; const int value = read(); position_ = saved; return value; }
    size_t write(uint8_t) override { return 0; }
private:
    const char* prefix_;
    size_t prefixLength_, count_, arrayLength_, position_ = 0;
};

