20233332choi/DJY_EvTLMT/firmware/esp32_ev_gateway/src/main.cpp
void stageRelayTelemetry(const char* json) {
    static char columns[sizeof(relayColumns)], row[1536];
    const bool valid = telemetryColumns(json, columns, sizeof(columns), row, sizeof(row));
    portENTER_CRITICAL(&relayMux);
    if (!valid || (relayColumns[0] && strcmp(relayColumns, columns))) relaySamples.reject();
    else {
        if (!relayColumns[0]) memcpy(relayColumns, columns, strlen(columns) + 1);
        relaySamples.push(state.sequence, row);
    }
    portEXIT_CRITICAL(&relayMux);
}

void stageRelayCommand(const String& response) {
#if EV_RELAY_ACCEPT_COMMANDS
    if (!jsonStringEquals(response, "type", "live_tv") &&
        !jsonStringEquals(response, "type", "pit_config") &&
        !jsonStringEquals(response, "type", "relay_ping")) return;
    portENTER_CRITICAL(&relayMux);
    strlcpy(relayCommand, response.c_str(), sizeof(relayCommand));
    relayCommandPending = true;
    ++relayCommandCount;
    portEXIT_CRITICAL(&relayMux);
#else
    (void)response;
#endif
}

void relayTask(void*) {
    String relayUrl(EV_RELAY_URL);
    /* Prefer TLS even for telemetry. Existing configs may still contain an
     * http:// ngrok URL from the original read-only implementation. */
    if (relayUrl.startsWith("http://") && !EV_ALLOW_PLAINTEXT_RELAY) {
        relayUrl = String("https://") + relayUrl.substring(7);
    }
    const String relayToken(EV_RELAY_TOKEN);
    const bool relayUsesTls = relayUrl.startsWith("https://");
    const bool relayUsesPlaintext = relayUrl.startsWith("http://");
    if ((!relayUsesTls && !relayUsesPlaintext) || relayToken.length() < 16u) {
        Serial.println("# Internet relay disabled: configure URL and a token of at least 16 characters");
        vTaskDelete(nullptr);
        return;
    }
    if (relayUsesPlaintext && !EV_ALLOW_PLAINTEXT_RELAY) {
        Serial.println("# HTTP relay disabled: set EV_ALLOW_PLAINTEXT_RELAY for bench use");
        vTaskDelete(nullptr);
        return;
    }

    const int authorityStart = relayUrl.indexOf("//") + 2;
    const int pathStart = relayUrl.indexOf('/', authorityStart);
    String relayAuthority = pathStart >= 0 ? relayUrl.substring(authorityStart, pathStart)
                                           : relayUrl.substring(authorityStart);
    uint16_t relayPort = relayUsesTls ? 443 : 80;
    const int portMarker = relayAuthority.lastIndexOf(':');
    if (portMarker > 0) {
        relayPort = static_cast<uint16_t>(relayAuthority.substring(portMarker + 1).toInt());
        relayAuthority = relayAuthority.substring(0, portMarker);
    }

    snprintf(relayStreamId, sizeof(relayStreamId), "%08lx%08lx",
             static_cast<unsigned long>(esp_random()), static_cast<unsigned long>(esp_random()));
    uint32_t retryMs = 1000;
    bool networkPathChecked = false;
    bool networkTimeRequested = false;
#if EV_TLS_DIAGNOSTICS_ONCE
    bool tlsProbed = false;
#endif
    // Keep the authenticated TLS socket alive across telemetry exchanges.
    WiFiClient plainClient;
#if EV_RELAY_FAST_RSA_TLS
    NgrokTlsClient secureClient;
#else
    WiFiClientSecure secureClient;
#endif
    static const char* relayAlpn[] = {"http/1.1", nullptr};
    secureClient.setAlpnProtocols(relayAlpn);
    WiFiClient* relayClient = relayUsesTls ? static_cast<WiFiClient*>(&secureClient) : &plainClient;
#if defined(EV_RELAY_CA_CERT)
    secureClient.setCACert(EV_RELAY_CA_CERT);
#elif EV_RELAY_ALLOW_INSECURE_TLS
    secureClient.setInsecure();
#else
    secureClient.setCACert(kLetsEncryptGenYRoots);
#endif
    secureClient.setHandshakeTimeout(5);
    HTTPClient http;
    http.useHTTP10(false);
    http.setReuse(true);
    http.setConnectTimeout(5000);
    http.setTimeout(2500);
    for (;;) {
        if (WiFi.status() != WL_CONNECTED) {
            relayClient->stop();
            networkPathChecked = false;
            vTaskDelay(pdMS_TO_TICKS(500));
            continue;
        }

        /* X.509 validation is meaningless while the ESP still thinks it is
         * 1970. NTP runs in the networking stack; only this low-priority relay
         * task waits, while UART and vehicle telemetry continue normally. */
        if (relayUsesTls && time(nullptr) < 1700000000) {
            if (!networkTimeRequested) {
                configTime(0, 0, "pool.ntp.org", "time.google.com");
                networkTimeRequested = true;
            }
            vTaskDelay(pdMS_TO_TICKS(500));
            continue;
        }

#if EV_TLS_DIAGNOSTICS_ONCE
        if (!tlsProbed) {
            // Delay permits a serial observer to attach after an upload reset.
            vTaskDelay(pdMS_TO_TICKS(8000));
            for (unsigned profile = 3; profile < 5; ++profile) {
                RelayTlsProbe probe;
                probe.run(relayAuthority.c_str(), relayPort, kLetsEncryptGenYRoots, profile);
            }
            tlsProbed = true;
        }
#endif
        if (!networkPathChecked) {
            IPAddress relayAddress;
            const int dnsOk = WiFi.hostByName(relayAuthority.c_str(), relayAddress) == 1 ? 1 : -1;
            int tcpOk = 0;
            if (dnsOk == 1) {
                Serial.printf("# Relay resolved=%s epoch=%ld free_heap=%u\n",
                              relayAddress.toString().c_str(), static_cast<long>(time(nullptr)),
                              static_cast<unsigned>(ESP.getFreeHeap()));
                WiFiClient tcpProbe;
                tcpOk = tcpProbe.connect(relayAddress, relayPort, 5000) == 1 ? 1 : -1;
                tcpProbe.stop();
            }
            portENTER_CRITICAL(&relayMux);
            relayDnsStatus = dnsOk;
            relayTcp443Status = tcpOk;
            portEXIT_CRITICAL(&relayMux);
            networkPathChecked = true;
        }

        uint32_t lastSequence = 0;
        uint32_t droppedSamples = 0;
        size_t queuedSamples = 0;
        size_t arrayLength = 0;
        const uint32_t exchangeStart = millis();
        portENTER_CRITICAL(&relayMux);
        droppedSamples = relaySamples.dropped();
        const int prefix = snprintf(relayPrefix, sizeof(relayPrefix),
            "{\"stream_id\":\"%s\",\"sent_ms\":%lu,\"dropped_samples\":%lu,"
            "\"queue_samples\":%u,\"queue_bytes\":%u,\"columns\":%s,\"samples\":",
            relayStreamId, static_cast<unsigned long>(exchangeStart), static_cast<unsigned long>(droppedSamples),
            static_cast<unsigned>(relaySamples.count()), static_cast<unsigned>(relaySamples.bytes()),
            relayColumns[0] ? relayColumns : "[]");
        queuedSamples = relaySamples.batchInfo(kRelayBatchSize - static_cast<size_t>(prefix) - 1, 64, lastSequence, arrayLength);
        portEXIT_CRITICAL(&relayMux);
        if (queuedSamples == 0) {
            vTaskDelay(pdMS_TO_TICKS(20));
            continue;
        }
        RelayBody body(relayPrefix, queuedSamples, arrayLength);

        bool success = false;
        if (http.begin(*relayClient, relayUrl)) {
            http.addHeader("Content-Type", "application/json");
            http.addHeader("Authorization", String("Bearer ") + relayToken);
            http.addHeader("X-Vehicle-ID", EV_VEHICLE_ID);
            http.addHeader("ngrok-skip-browser-warning", "1");
            const int status = http.sendRequest("POST", &body, static_cast<size_t>(body.available()));
            char tlsErrorText[96] = {};
            const int tlsError = relayUsesTls && status < 0
                                     ? secureClient.lastError(tlsErrorText, sizeof(tlsErrorText))
                                     : 0;
            portENTER_CRITICAL(&relayMux);
            relayLastHttpStatus = status;
            relayTlsError = tlsError;
            portEXIT_CRITICAL(&relayMux);
            if (status >= 200 && status < 300) {
                const String response = http.getString();
                const int ackStart = response.indexOf("\"ack_seq\"");
                const int ackColon = ackStart >= 0 ? response.indexOf(':', ackStart) : -1;
                const uint32_t ack = ackColon >= 0 ? strtoul(response.c_str() + ackColon + 1, nullptr, 10) : 0;
                if (ack == lastSequence) {
                    stageRelayCommand(response);
                    portENTER_CRITICAL(&relayMux);
                    relaySamples.acknowledge(ack);
                    ++relayTxCount;
                    relayLastSuccessMs = millis();
                    portEXIT_CRITICAL(&relayMux);
                    retryMs = 1000;
                    success = true;
                }
            }
            http.end();
        } else {
            portENTER_CRITICAL(&relayMux);
            relayLastHttpStatus = -1000;
            portEXIT_CRITICAL(&relayMux);
        }
        if (!success) {
            relayClient->stop();
            portENTER_CRITICAL(&relayMux);
            ++relayErrorCount;
            portEXIT_CRITICAL(&relayMux);
            vTaskDelay(pdMS_TO_TICKS(retryMs));
            retryMs = min<uint32_t>(retryMs * 2u, 5000u);
        } else {
            // At most 5 exchanges/s; HTTP time is part of the 200 ms period.
            const uint32_t elapsed = millis() - exchangeStart;
            if (elapsed < 200u) vTaskDelay(pdMS_TO_TICKS(200u - elapsed));
        }
    }
}
#endif

void setStatusLed(uint8_t red, uint8_t green, uint8_t blue) {
#if EV_STATUS_LED_ENABLED
    neopixelWrite(EV_STATUS_LED_GPIO, red, green, blue);
#else
    (void)red;
    (void)green;
    (void)blue;
#endif
}

void runStatusLedSelfTest() {
#if EV_STATUS_LED_ENABLED
    setStatusLed(255, 0, 0);
    delay(350);
    setStatusLed(0, 255, 0);
    delay(350);
    setStatusLed(0, 0, 255);
    delay(350);
    setStatusLed(0, 0, 0);
#endif
}

void maintainWifi() {
    static uint32_t lastReport = 0;
    const uint32_t reportNow = millis();
    if (reportNow - lastReport >= 2000u) {
        lastReport = reportNow;
        Serial.printf("# WiFi status=%d ip=%s rssi=%ld reconnects=%lu\n",
                      static_cast<int>(WiFi.status()), WiFi.localIP().toString().c_str(),
                      WiFi.status() == WL_CONNECTED ? static_cast<long>(WiFi.RSSI()) : -127L,
                      static_cast<unsigned long>(wifiReconnectAttempts));
    }
    if (WiFi.status() == WL_CONNECTED) return;
    const uint32_t now = millis();
    if (now - wifiLastReconnectMs < 15000u) return;
    wifiLastReconnectMs = now;
    ++wifiReconnectAttempts;
    if (!WiFi.reconnect()) {
        WiFi.begin(EV_WIFI_SSID, EV_WIFI_PASSWORD);
    }
}

void updateStatusLed() {
#if EV_STATUS_LED_ENABLED
    const uint32_t now = millis();
    static uint32_t previous = 0;
    if (now - previous < 100u) return;
    previous = now;

    const bool blink = (now / 500u) % 2u == 0u;
    if (WiFi.status() != WL_CONNECTED) {
        setStatusLed(0, 0, blink ? 64 : 0);  // Blue: joining hotspot.
        return;
    }

#if EV_RELAY_ENABLED
    uint32_t relayTx = 0, relaySuccessMs = 0;
    portENTER_CRITICAL(&relayMux);
    relayTx = relayTxCount;
    relaySuccessMs = relayLastSuccessMs;
    portEXIT_CRITICAL(&relayMux);
    if (relayTx > 0u && now - relaySuccessMs < 5000u) {
        setStatusLed(0, 64, 0);  // Green: live HTTPS telemetry upload.
    } else {
        setStatusLed(blink ? 64 : 0, blink ? 32 : 0, 0);  // Yellow: relay retrying.
    }
#else
    setStatusLed(0, 48, 48);  // Cyan: local Wi-Fi/UDP mode only.
#endif
#endif
}

float throttlePercent() {
    if (state.tpsReportedPct >= 0) return static_cast<float>(state.tpsReportedPct);
    constexpr float kMin = 868.0f, kMax = 3102.0f;
    return constrain((static_cast<float>(state.tpsRaw) - kMin) * 100.0f / (kMax - kMin), 0.0f, 100.0f);
}

