20233332choi/DJY_EvTLMT/firmware/esp32_ev_gateway/src/main.cpp
int16_t sasWrappedDelta() {
    int32_t delta = static_cast<int32_t>(state.sasRaw) - static_cast<int32_t>(kSasCenterRaw);
    if (delta > 8191) delta -= kSasCounts;
    if (delta < -8192) delta += kSasCounts;
    return static_cast<int16_t>(delta);
}

float sasAbsoluteDeg() {
    return static_cast<float>(state.sasRaw) * 360.0f / static_cast<float>(kSasCounts);
}

float sasRelativeDeg() {
    return static_cast<float>(sasWrappedDelta()) * 360.0f / static_cast<float>(kSasCounts);
}

float speedKmh() {
    // User-confirmed tire outside diameter 45 cm and reduction 4:1.
    // Keep STM vehicleSpeedMS separately as its original control input.
    constexpr float kGearRatio = 4.0f, kTireRadiusM = 0.225f;
    // A single noisy/missing wheel must never become vehicle speed.
    if ((state.rpmLeft == 0u) != (state.rpmRight == 0u)) return 0.0f;
    const float motorRpm = 0.5f * (state.rpmLeft + state.rpmRight);
    return motorRpm / kGearRatio * (2.0f * PI * kTireRadiusM) / 60.0f * 3.6f;
}

bool pitAllowed() {
    return canReady && state.rearMs != 0u && digitalRead(EV_PIT_ENABLE_GPIO) == LOW &&
           millis() - state.rearMs < 300u &&
           throttlePercent() <= 2.0f && state.rpmLeft <= 30u && state.rpmRight <= 30u;
}

void sendEspStatus() {
    static uint32_t previous = 0;
    static uint8_t sequence = 0;
    const uint32_t now = millis();
    if (!canReady || now - previous < 100u) return;
    previous = now;

    DjyEspStatus status = {};
    if (digitalRead(EV_PIT_ENABLE_GPIO) == LOW) status.flags |= DJY_ESP_STATUS_PIT_ENABLE;
    if (WiFi.status() == WL_CONNECTED) status.flags |= DJY_ESP_STATUS_WIFI_CONNECTED;
    status.flags |= DJY_ESP_STATUS_CAN_RUNNING;
    status.sequence = sequence++;
    status.uptime_100ms = static_cast<uint16_t>((now / 100u) & 0xffffu);

    twai_message_t frame = {};
    frame.identifier = DJY_CAN_ID_ESP_STATUS;
    frame.data_length_code = DJY_CAN_DLC_ESP_STATUS;
    djy_pack_esp_status(frame.data, status);
    (void)twai_transmit(&frame, pdMS_TO_TICKS(5));
}

int jsonInteger(const String& input, const char* key, int fallback) {
    String marker = String('"') + key + "\":";
    int start = input.indexOf(marker);
    if (start < 0) return fallback;
    start += marker.length();
    while (start < input.length() && input[start] == ' ') ++start;
    return input.substring(start).toInt();
}

uint16_t bmsU16(const uint8_t* data, uint8_t offset) {
    return static_cast<uint16_t>((static_cast<uint16_t>(data[offset]) << 8) | data[offset + 1]);
}

uint32_t bmsU32(const uint8_t* data, uint8_t offset) {
    return (static_cast<uint32_t>(data[offset]) << 24) |
           (static_cast<uint32_t>(data[offset + 1]) << 16) |
           (static_cast<uint32_t>(data[offset + 2]) << 8) | data[offset + 3];
}

#if EV_BMS_CAN_ENABLED
bool sendBmsCanRequest(uint8_t id) {
    twai_message_t request = {};
    request.identifier = 0x18000000u | (static_cast<uint32_t>(id) << 16) | 0x0140u;
    request.extd = 1;
    request.data_length_code = 8;
    return twai_transmit(&request, 0) == ESP_OK;
}
#endif

bool rearSamplePending = false, bmsSamplePending = false;
void publishTelemetry();

void receiveBmsCan() {
#if EV_BMS_CAN_ENABLED
    twai_message_t frame = {};
    while (twai_receive(&frame, 0) == ESP_OK) {
        if (!frame.extd || frame.rtr || frame.data_length_code != 8) continue;
        const uint8_t id = static_cast<uint8_t>((frame.identifier >> 16) & 0xffu);
        if (id < 0x90 || id > 0x98 ||
            frame.identifier != (0x18000000u | (static_cast<uint32_t>(id) << 16) | 0x4001u)) continue;
        const uint8_t* d = frame.data;
        bms.lastRxMs = millis();
        if (id == 0x90) {
            // These are ESP dequeue times, not BMS ADC acquisition timestamps.
            if (bms.powerSeen) {
                bms.powerRxIntervalMs = bms.lastRxMs - bms.powerLastRxMs;
                if (bms.powerRxIntervalMs > bms.powerMaxRxIntervalMs)
                    bms.powerMaxRxIntervalMs = bms.powerRxIntervalMs;
            }
            bms.powerSeen = true;
            bms.powerLastRxMs = bms.lastRxMs;
            ++bms.powerRxCount;
            bms.voltage = bmsU16(d, 0) / 10.0f;
            bms.current = (static_cast<int32_t>(bmsU16(d, 4)) - 30000) / 10.0f;
            bms.soc = bmsU16(d, 6) / 10.0f;
            // Preserve each voltage/current response, even between Rear frames.
            bmsSamplePending = true;
            publishTelemetry();
        } else if (id == 0x91) {
            bms.maxCell = bmsU16(d, 0) / 1000.0f; bms.maxCellNumber = d[2];
            bms.minCell = bmsU16(d, 3) / 1000.0f; bms.minCellNumber = d[5];
        } else if (id == 0x92) {
            bms.maxTemp = static_cast<float>(d[0]) - 40.0f;
            bms.minTemp = static_cast<float>(d[2]) - 40.0f;
        } else if (id == 0x93) {
            bms.state = d[0]; bms.chargeMos = d[1] != 0; bms.dischargeMos = d[2] != 0;
            bms.life = d[3]; bms.remainingAh = bmsU32(d, 4) / 1000.0f;
        } else if (id == 0x94) {
            bms.cellCount = d[0] > 48 ? 48 : d[0]; bms.tempCount = d[1] > 16 ? 16 : d[1];
            bms.charger = d[2] != 0; bms.load = d[3] != 0; bms.cycleCount = bmsU16(d, 6);
        } else if (id == 0x95) {
            if (d[0] != 0) {
                const uint8_t firstCell = static_cast<uint8_t>((d[0] - 1u) * 3u);
                for (uint8_t i = 0; i < 3 && firstCell + i < 48; ++i) {
                    const uint8_t cell = static_cast<uint8_t>(firstCell + i);
                    bms.cells[cell] = bmsU16(d, static_cast<uint8_t>(1u + i * 2u)) / 1000.0f;
                    bms.cellSeen[cell] = bms.cells[cell] > 0.0f;
                }
            }
        } else if (id == 0x97) {
            bms.balancing = false;
            for (uint8_t i = 0; i < 8; ++i) bms.balancing = bms.balancing || d[i] != 0;
        } else if (id == 0x98) {
            memcpy(bms.alarm, d, sizeof(bms.alarm));
        }
    }
    const uint32_t now = millis();
    if (bmsCanReady && static_cast<int32_t>(now - bmsNextPowerRequestMs) >= 0) {
        if (sendBmsCanRequest(0x90)) {
            if (bms.powerRequested) {
                const uint32_t interval = now - bms.powerLastRequestMs;
                if (interval > bms.powerMaxRequestIntervalMs)
                    bms.powerMaxRequestIntervalMs = interval;
            }
            bms.powerRequested = true;
            bms.powerLastRequestMs = now;
            ++bms.powerRequestCount; // Accepted by TWAI, not a confirmed BMS reply.
        } else {
            ++bms.powerTxErrors;
        }
        // No burst of catch-up requests after a delayed loop or a full TX queue.
        bmsNextPowerRequestMs = now + 10u;
    }
    if (bmsCanReady && static_cast<int32_t>(now - bmsNextRequestMs) >= 0) {
        if (sendBmsCanRequest(bmsRequestId)) {
            bmsRequestId = bmsRequestId == 0x98 ? 0x91 : static_cast<uint8_t>(bmsRequestId + 1u);
            bmsNextRequestMs = now + 100u;
        } else {
            bmsNextRequestMs = now + 20u;
        }
    }
#endif
}

