20233332choi/DJY_EvTLMT/firmware/esp32_ev_gateway/src/main.cpp
bool jsonBoolean(const String& input, const char* key, bool fallback) {
    String marker = String('"') + key + "\":";
    int start = input.indexOf(marker);
    if (start < 0) return fallback;
    start += marker.length();
    while (start < input.length() && input[start] == ' ') ++start;
    if (input.startsWith("true", start)) return true;
    if (input.startsWith("false", start)) return false;
    return fallback;
}

void receiveCan() {
    twai_message_t frame = {};
    while (twai_receive(&frame, 0) == ESP_OK) {
        if (frame.extd || frame.rtr) continue;
        const uint32_t now = millis();
        if (frame.identifier == DJY_CAN_ID_SENSOR_DATA && frame.data_length_code == 4) {
            state.sasRaw = djy_u16(&frame.data[0]) & 0x3fffu;
            state.tpsRaw = djy_u16(&frame.data[2]) & 0x0fffu;
            state.tpsReportedPct = -1;
            state.sasMs = now;
            state.tpsMs = now;
        } else if (frame.identifier == DJY_CAN_ID_DRIVER_CONTROL && frame.data_length_code == 8 &&
                   frame.data[5] == DJY_PROTOCOL_VERSION && frame.data[7] == djy_crc8(frame.data, 7)) {
            state.tvRequested = frame.data[0]; state.regenRequested = frame.data[1];
            state.driveMode = frame.data[2]; state.controlFlags = frame.data[3];
            state.driverSequence = frame.data[4]; state.driverMs = now;
        } else if (frame.identifier == DJY_CAN_ID_REAR_STATUS && frame.data_length_code == 8 &&
                   frame.data[6] == DJY_PROTOCOL_VERSION && frame.data[7] == djy_crc8(frame.data, 7)) {
            state.tvApplied = frame.data[0]; state.regenApplied = frame.data[1];
            state.driveMode = frame.data[2]; state.rearFlags = frame.data[3];
            state.fault = frame.data[4]; state.rearSequence = frame.data[5]; state.rearMs = now;
        } else if (frame.identifier == DJY_CAN_ID_REAR_DRIVETRAIN && frame.data_length_code == 8) {
            state.rpmLeft = djy_u16(&frame.data[0]); state.rpmRight = djy_u16(&frame.data[2]);
            state.dacLeft = djy_u16(&frame.data[4]); state.dacRight = djy_u16(&frame.data[6]);
        } else if (frame.identifier == DJY_CAN_ID_PIT_CONFIG_ACK && frame.data_length_code == 8 &&
                   frame.data[6] == DJY_PROTOCOL_VERSION && frame.data[7] == djy_crc8(frame.data, 7)) {
            state.tvLimit = frame.data[0]; state.regenLimit = frame.data[1];
            state.tvRamp = static_cast<uint16_t>(frame.data[2]) * 10u;
            state.regenRamp = static_cast<uint16_t>(frame.data[3]) * 5u;
            state.configSequence = frame.data[5]; state.configAck = true;
        }
    }
}

bool parseRearTelemetry(const uint8_t* data, size_t size) {
    DjyTelemetry p;
    if (!djy_telemetry_unpack(&p, data, size)) return false;
    if (state.rearBinarySeen) {
        if (p.sequence == state.rearSampleSequence && p.snapshot_us == state.rearSnapshotUs) {
            ++state.rearDuplicateSamples;
            return false; // Do not refresh data freshness for replayed samples.
        }
        if (p.snapshot_us < state.rearSnapshotUs) {
            ++state.rearClockResets;
        } else {
            const uint32_t advance = p.sequence - state.rearSampleSequence;
            if (advance > 0u && advance <= 0x7fffffffu)
                state.rearMissingSamples += advance - 1u;
        }
    }
    const uint32_t now = millis();
    state.rearBinarySeen = true;
    state.rearSampleSequence = p.sequence;
    state.rearSnapshotUs = p.snapshot_us;
    state.rearTxSkipped = p.tx_skipped;
    state.captureLeft = p.capture_left; state.captureRight = p.capture_right;
    state.glitchLeft = p.glitch_left; state.glitchRight = p.glitch_right;
    // Preserve the existing telemetry noise check without uint32 wrap.
    state.rpmLeft = uint64_t(p.glitch_left) > uint64_t(p.capture_left) + 100u ? 0u : p.rpm_left;
    state.rpmRight = uint64_t(p.glitch_right) > uint64_t(p.capture_right) + 100u ? 0u : p.rpm_right;
    state.rpmLeftValid = (p.flags & DJY_TM_RPM_LEFT_VALID) != 0u;
    state.rpmRightValid = (p.flags & DJY_TM_RPM_RIGHT_VALID) != 0u;
    state.tpsRaw = p.tps_raw; state.tpsReportedPct = p.tps_pct;
    state.sasRaw = p.sas_raw; state.sasCenterRaw = p.sas_center;
    state.sasValid = (p.flags & DJY_TM_SAS_VALID) != 0u;
    state.steeringRad = p.steer_milli / 1000.0f;
    state.imuValid = (p.flags & DJY_TM_IMU_VALID) != 0u;
    state.yawRateRadS = p.yaw_milli / 1000.0f;
    state.lateralAccelMS2 = p.lat_milli / 1000.0f;
    state.longitudinalAccelMS2 = state.imuRawAx = p.ax_milli / 1000.0f;
    state.imuRawAy = p.ay_milli / 1000.0f; state.imuRawAz = p.az_milli / 1000.0f;
    state.vehicleSpeedMS = p.speed_milli / 1000.0f;
    state.desiredYawRadS = p.desired_yaw_milli / 1000.0f;
    state.yawErrorRadS = p.yaw_error_milli / 1000.0f;
    state.deltaPowerKw = p.delta_power_milli / 1000.0f;
    state.powerLeftKw = p.power_left_milli / 1000.0f;
    state.powerRightKw = p.power_right_milli / 1000.0f;
    state.tractionScale = p.traction_milli / 1000.0f;
    state.pidKp = p.kp_milli / 1000.0f;
    state.pidKi = p.ki_milli / 1000.0f; state.pidKd = p.kd_milli / 1000.0f;
    state.tvRequested = p.requested; state.tvLimit = p.limit; state.tvApplied = p.applied;
    state.configSequence = p.command_sequence;
    state.configAck = liveCommandSeen && state.configSequence == liveCommand.sequence;
    const bool controlFresh = (p.flags & DJY_TM_CONTROL_FRESH) != 0u;
    state.driverMs = controlFresh ? now : 0u;
    state.edActive = (p.flags & DJY_TM_ED_ACTIVE) != 0u;
    state.rearFlags = 0u;
    if (controlFresh) state.rearFlags |= DJY_REAR_STATUS_CONTROL_FRESH;
    if (p.flags & DJY_TM_TV_ACTIVE) state.rearFlags |= DJY_REAR_STATUS_TV_ACTIVE;
    if (state.edActive) state.rearFlags |= DJY_REAR_STATUS_ED_ACTIVE;
    if (p.fault) state.rearFlags |= DJY_REAR_STATUS_FAULT;
    state.fault = p.fault; state.dacLeft = p.dac_left; state.dacRight = p.dac_right;
    state.rearCommandRx = p.command_rx; state.rearCommandErrors = p.command_errors;
    state.stmCanRx = p.can_rx; state.stmCanErrors = p.can_errors; state.stmCanStatus = p.can_status;
    state.stmImuDiag0 = p.imu_gyro_ok; state.stmImuDiag1 = p.imu_pkt_bad;
    state.stmImuDiag2 = p.imu_resync; state.stmImuDiag3 = p.imu_dma_restart;
    state.timing.valid = p.timing_valid != 0u;
    for (unsigned i = 0; i < DJY_TELEMETRY_TIMING_WORDS; ++i)
        state.timing.fields[i] = i == 11u ? int64_t(djy_tm_signed(p.timing[i])) : int64_t(p.timing[i]);
    state.tpsMs = state.sasMs = state.rearMs = now;
    state.pidMs = state.rearExtendedMs = state.tqvInternalMs = now;
    ++state.rearSequence;
    ++state.rearUartRx;
    return true;
}

bool parseRearUartLine(const char* line) {
    unsigned rpmLeft = 0, rpmRight = 0, tpsRaw = 0, idleRaw = 0;
    unsigned espFresh = 0, espSequence = 0;
    unsigned imuValid = 0, sasRaw = 0;
    long yawMilli = 0, latMilli = 0, lonMilli = 0;
    long axMilli = 0, ayMilli = 0, azMilli = 0;
    unsigned long captureLeft = 0, captureRight = 0;
    unsigned long glitchLeft = 0, glitchRight = 0, espRxCount = 0;
    int tpsPct = 0;
    const int headFields = sscanf(
        line,
        "L=%u R=%u cap=%lu/%lu glt=%lu/%lu",
        &rpmLeft, &rpmRight, &captureLeft, &captureRight, &glitchLeft, &glitchRight);
    // Team firmware can insert diagnostic fields between glt and tps. Locate
    // the stable TPS marker instead of requiring one monolithic sentence.
    const char* tps = strstr(line, " tps=");
    const int tpsFields = tps == nullptr ? 0 :
        sscanf(tps, " tps=%u pct=%d idle=%u", &tpsRaw, &tpsPct, &idleRaw);
    const char* esp = strstr(line, " esp=");
    if (esp != nullptr) {
        (void)sscanf(esp, " esp=%u/%u rx=%lu", &espFresh, &espSequence, &espRxCount);
    }
    if (headFields != 6 || tpsFields != 3 || rpmLeft > 65535u || rpmRight > 65535u ||
        tpsRaw > 4095u || idleRaw > 4095u || tpsPct < 0 || tpsPct > 100) return false;
    state.timing.parse(line); // Missing/malformed extension clears previous timing.

