20233332choi/DJY_EvTLMT/firmware/esp32_ev_gateway/src/main.cpp
    unsigned validLeft = 0, validRight = 0;
    const char* validity = strstr(line, " rv=");
    if (validity != nullptr && (sscanf(validity, " rv=%u/%u", &validLeft, &validRight) != 2 ||
                               validLeft > 1u || validRight > 1u)) return false;
    // Missing validity is unverified, not a valid stationary measurement.
    state.rpmLeftValid = validity != nullptr && validLeft == 1u;
    state.rpmRightValid = validity != nullptr && validRight == 1u;

    // A stopped motor can leave an un-driven capture input floating. If almost
    // every capture was rejected as a glitch, never present that RPM as real.
    const bool leftSignalInvalid = glitchLeft > captureLeft + 100u;
    const bool rightSignalInvalid = glitchRight > captureRight + 100u;
    (void)idleRaw;
    (void)espFresh;
    (void)espSequence;
    (void)espRxCount;

    state.rpmLeft = leftSignalInvalid ? 0u : static_cast<uint16_t>(constrain(rpmLeft, 0u, 65535u));
    state.rpmRight = rightSignalInvalid ? 0u : static_cast<uint16_t>(constrain(rpmRight, 0u, 65535u));
    state.captureLeft = static_cast<uint32_t>(captureLeft);
    state.captureRight = static_cast<uint32_t>(captureRight);
    state.glitchLeft = static_cast<uint32_t>(glitchLeft);
    state.glitchRight = static_cast<uint32_t>(glitchRight);
    state.tpsRaw = static_cast<uint16_t>(constrain(tpsRaw, 0u, 65535u));
    state.tpsReportedPct = static_cast<int16_t>(constrain(tpsPct, 0, 100));
    state.rearSequence++;
    const uint32_t now = millis();
    state.tpsMs = now;
    state.rearMs = now;

    unsigned long diag0 = 0, diag1 = 0, diag2 = 0, diag3 = 0;
    const char* desync = strstr(line, " dsy=");
    if (desync != nullptr && sscanf(desync, " dsy=%lu/%lu", &diag0, &diag1) == 2) {
        state.desyncLeft = static_cast<uint32_t>(diag0);
        state.desyncRight = static_cast<uint32_t>(diag1);
    }
    const char* canDiag = strstr(line, " can=");
    if (canDiag != nullptr && sscanf(canDiag, " can=%lu/%lu/%lx", &diag0, &diag1, &diag2) == 3) {
        state.stmCanRx = static_cast<uint32_t>(diag0);
        state.stmCanErrors = static_cast<uint32_t>(diag1);
        state.stmCanStatus = static_cast<uint32_t>(diag2);
    }

    const char* sensor = strstr(line, " imu=");
    const int sensorFields = sensor == nullptr ? 0 :
        sscanf(sensor, " imu=%u sas=%u yaw=%ld lat=%ld lon=%ld ax=%ld ay=%ld az=%ld",
               &imuValid, &sasRaw, &yawMilli, &latMilli, &lonMilli,
               &axMilli, &ayMilli, &azMilli);
    if (sensor != nullptr && sensorFields >= 4 &&
        imuValid <= 1u && sasRaw <= 16383u) {
        state.imuValid = imuValid != 0u;
        state.sasRaw = static_cast<uint16_t>(sasRaw);
        state.yawRateRadS = static_cast<float>(yawMilli) / 1000.0f;
        state.lateralAccelMS2 = static_cast<float>(latMilli) / 1000.0f;
        state.longitudinalAccelMS2 = static_cast<float>(lonMilli) / 1000.0f;
        state.imuRawAx = static_cast<float>(axMilli) / 1000.0f;
        state.imuRawAy = static_cast<float>(ayMilli) / 1000.0f;
        state.imuRawAz = static_cast<float>(azMilli) / 1000.0f;
        state.sasMs = now;
    } else {
        state.imuValid = false;
        state.sasMs = 0;
        state.yawRateRadS = 0.0f;
        state.lateralAccelMS2 = 0.0f;
        state.longitudinalAccelMS2 = 0.0f;
        state.imuRawAx = 0.0f;
        state.imuRawAy = 0.0f;
        state.imuRawAz = 0.0f;
    }
    if (sensor != nullptr && sscanf(sensor, " imu=%lu/%lu/%lu/%lu",
                                   &diag0, &diag1, &diag2, &diag3) == 4) {
        state.stmImuDiag0 = static_cast<uint32_t>(diag0);
        state.stmImuDiag1 = static_cast<uint32_t>(diag1);
        state.stmImuDiag2 = static_cast<uint32_t>(diag2);
        state.stmImuDiag3 = static_cast<uint32_t>(diag3);
    }
    const char* imuDiag = strstr(line, " idg=");
    if (imuDiag != nullptr && sscanf(imuDiag, " idg=%lu/%lu/%lu/%lu", &diag0, &diag1, &diag2, &diag3) == 4) {
        state.stmImuDiag0 = static_cast<uint32_t>(diag0);
        state.stmImuDiag1 = static_cast<uint32_t>(diag1);
        state.stmImuDiag2 = static_cast<uint32_t>(diag2);
        state.stmImuDiag3 = static_cast<uint32_t>(diag3);
    }

    long vehicleSpeedMilli = 0, desiredYawMilli = 0, yawErrorMilli = 0;
    long deltaPowerMilli = 0, powerLeftMilli = 0, powerRightMilli = 0, tractionMilli = 1000;
    unsigned tqvActive = 0, tqvEdActive = 0;
    const char* tqv = strstr(line, " vs=");
    const bool tqvExtended = tqv != nullptr && sscanf(
        tqv,
        " vs=%ld dy=%ld ye=%ld dp=%ld pl=%ld pr=%ld tva=%u eda=%u tr=%ld",
        &vehicleSpeedMilli, &desiredYawMilli, &yawErrorMilli, &deltaPowerMilli,
        &powerLeftMilli, &powerRightMilli, &tqvActive, &tqvEdActive, &tractionMilli) == 9 &&
        tqvActive <= 1u && tqvEdActive <= 1u && tractionMilli >= 0 && tractionMilli <= 1000;
    if (tqvExtended) {
        state.vehicleSpeedMS = static_cast<float>(vehicleSpeedMilli) / 1000.0f;
        state.desiredYawRadS = static_cast<float>(desiredYawMilli) / 1000.0f;
        state.yawErrorRadS = static_cast<float>(yawErrorMilli) / 1000.0f;
        state.deltaPowerKw = static_cast<float>(deltaPowerMilli) / 1000.0f;
        state.powerLeftKw = static_cast<float>(powerLeftMilli) / 1000.0f;
        state.powerRightKw = static_cast<float>(powerRightMilli) / 1000.0f;
        state.tractionScale = static_cast<float>(tractionMilli) / 1000.0f;
        state.edActive = tqvEdActive != 0u;
        if (tqvActive) state.rearFlags |= DJY_REAR_STATUS_TV_ACTIVE;
        else state.rearFlags &= static_cast<uint8_t>(~DJY_REAR_STATUS_TV_ACTIVE);
        if (state.edActive) state.rearFlags |= DJY_REAR_STATUS_ED_ACTIVE;
        else state.rearFlags &= static_cast<uint8_t>(~DJY_REAR_STATUS_ED_ACTIVE);
        state.rearExtendedMs = now;
        state.tqvInternalMs = now;
    } else {
        // A legacy/team sentence without these fields is an explicit
        // "not received" sample, not a new sample containing zeroes.
        state.vehicleSpeedMS = 0.0f;
        state.desiredYawRadS = 0.0f;
        state.yawErrorRadS = 0.0f;
        state.deltaPowerKw = 0.0f;
        state.powerLeftKw = 0.0f;
        state.powerRightKw = 0.0f;
        state.tractionScale = 1.0f;
        state.edActive = false;
        state.tqvInternalMs = 0u;
    }

