20233332choi/DJY_EvTLMT/firmware/esp32_ev_gateway/src/main.cpp
    long kp = 0, ki = 0, kd = 0;
    const char* pid = strstr(line, " kp=");
    state.pidMs = 0;
    if (pid != nullptr && sscanf(pid, " kp=%ld ki=%ld kd=%ld", &kp, &ki, &kd) == 3 &&
        kp >= 0 && ki >= 0 && kd >= 0) {
        state.pidKp = kp / 1000.0f;
        state.pidKi = ki / 1000.0f;
        state.pidKd = kd / 1000.0f;
        state.pidMs = now;
    }

    unsigned controlFresh = 0, controlSequence = 0, requested = 0, limit = 100, applied = 0;
    unsigned tvActive = 0, edActive = 0, fault = 0, dacLeft = 0, dacRight = 0;
    // Optional IMU/SAS fields are declared above with the base fields.
    unsigned long uartRx = 0, uartErrors = 0;
    const char* control = strstr(line, " ctl=");
    if (control != nullptr && sscanf(
            control,
            " ctl=%u/%u req=%u lim=%u app=%u tv=%u ed=%u fault=%u dac=%u/%u sas=%u imu=%u urx=%lu uerr=%lu",
            &controlFresh, &controlSequence, &requested, &limit, &applied,
            &tvActive, &edActive, &fault, &dacLeft, &dacRight, &sasRaw,
            &imuValid, &uartRx, &uartErrors) == 14) {
        state.tvRequested = static_cast<uint8_t>(constrain(requested, 0u, 100u));
        state.tvLimit = static_cast<uint8_t>(constrain(limit, 0u, 100u));
        state.tvApplied = static_cast<uint8_t>(constrain(applied, 0u, 100u));
        state.configSequence = static_cast<uint8_t>(controlSequence);
        state.configAck = liveCommandSeen && state.configSequence == liveCommand.sequence;
        state.driverMs = controlFresh ? now : 0u;
        state.rearFlags = 0u;
        if (controlFresh) state.rearFlags |= DJY_REAR_STATUS_CONTROL_FRESH;
        if (tvActive) state.rearFlags |= DJY_REAR_STATUS_TV_ACTIVE;
        if (edActive) state.rearFlags |= DJY_REAR_STATUS_ED_ACTIVE;
        if (fault) state.rearFlags |= DJY_REAR_STATUS_FAULT;
        state.fault = static_cast<uint8_t>(fault);
        state.dacLeft = static_cast<uint16_t>(constrain(dacLeft, 0u, 4095u));
        state.dacRight = static_cast<uint16_t>(constrain(dacRight, 0u, 4095u));
        state.sasRaw = static_cast<uint16_t>(sasRaw & 0x3fffu);
        state.sasMs = now;
        state.imuValid = imuValid != 0u;
        // These are commands received by STM, not telemetry received by ESP.
        state.rearCommandRx = static_cast<uint32_t>(uartRx);
        state.rearCommandErrors = static_cast<uint32_t>(uartErrors);
        state.rearExtendedMs = now;
    } else {
        // Legacy firmware reports RPM/TPS only; do not retain old optional data.
        if (!tqvExtended) state.rearExtendedMs = 0;
        state.driverMs = 0;
        state.configAck = false;
    }
    long steeringMilli = 0;
    unsigned sasValid = 0, sasCenter = 0;
    const char* steering = strstr(line, " steer=");
    state.sasValid = false;
    state.steeringRad = 0.0f;
    if (steering != nullptr && sscanf(steering, " steer=%ld sv=%u sc=%u",
            &steeringMilli, &sasValid, &sasCenter) == 3 &&
            steeringMilli >= -3142 && steeringMilli <= 3142 && sasValid <= 1u && sasCenter < 16384u) {
        state.sasValid = sasValid != 0u;
        state.sasCenterRaw = static_cast<uint16_t>(sasCenter);
        state.steeringRad = static_cast<float>(steeringMilli) / 1000.0f;
    }
    ++state.rearUartRx;
    return true;
}

void receiveRearUart() {
#if EV_REAR_UART_BINARY
    static DjyTelemetryRx receiver = {};
    static uint32_t lastByteMs = 0;
    if (receiver.used && millis() - lastByteMs > 50u) {
        receiver.used = 0; // Discard incomplete frames after a prolonged gap.
        ++state.rearUartErrors;
    }
    if (digitalRead(EV_REAR_UART_RX_GPIO) == HIGH) ++state.rearRxHigh;
    else ++state.rearRxLow;
    while (rearUart.available()) {
        ++state.rearUartBytes;
        lastByteMs = millis();
        const uint32_t errorsBefore = receiver.errors;
        const bool ready = djy_telemetry_push(&receiver, static_cast<uint8_t>(rearUart.read()));
        state.rearUartErrors += receiver.errors - errorsBefore;
        if (ready) {
            if (!parseRearTelemetry(receiver.bytes, DJY_TELEMETRY_SIZE)) ++state.rearUartErrors;
            else {
                rearSamplePending = true;
                publishTelemetry();
            }
        }
    }
#else
    static RearUartLine line;
    if (digitalRead(EV_REAR_UART_RX_GPIO) == HIGH) ++state.rearRxHigh;
    else ++state.rearRxLow;
    while (rearUart.available()) {
        ++state.rearUartBytes;
        const auto result = line.push(static_cast<char>(rearUart.read()));
        if (result == RearUartLine::Dropped) {
            ++state.rearUartErrors;
        } else if (result == RearUartLine::Ready && line.data()[0] != '\0') {
            if (!parseRearUartLine(line.data())) ++state.rearUartErrors;
            else {
                // Snapshot each complete Rear record before parsing the next.
                rearSamplePending = true;
                publishTelemetry();
            }
        }
    }
#endif
}

void sendPitConfig(const String& input) {
    if (!pitAllowed()) return;
    twai_message_t frame = {};
    frame.identifier = DJY_CAN_ID_PIT_CONFIG;
    frame.data_length_code = 8;
    frame.data[0] = constrain(jsonInteger(input, "tv_limit_pct", state.tvLimit), 0, 100);
    frame.data[1] = constrain(jsonInteger(input, "regen_limit_pct", state.regenLimit), 0, 100);
    frame.data[2] = constrain(jsonInteger(input, "tv_ramp_pct_s", 200) / 10, 1, 25);
    frame.data[3] = constrain(jsonInteger(input, "regen_ramp_pct_s", 50) / 5, 1, 20);
    frame.data[4] = (jsonBoolean(input, "tv_enable", true) ? DJY_PIT_FLAG_TV_PERMITTED : 0u) |
                    (jsonBoolean(input, "regen_enable", false) ? DJY_PIT_FLAG_REGEN_PERMITTED : 0u);
    frame.data[5] = static_cast<uint8_t>(jsonInteger(input, "request_id", state.configSequence + 1));
    frame.data[6] = DJY_PROTOCOL_VERSION;
    frame.data[7] = djy_crc8(frame.data, 7);
    state.configAck = false;
    (void)twai_transmit(&frame, pdMS_TO_TICKS(5));
}

void acceptLiveTvCommand(const String& input) {
    const int requested = jsonInteger(input, "strength_pct", -1);
    const int limit = jsonInteger(input, "limit_pct", -1);
    if (requested < 0 || requested > 100 || limit < 0 || limit > 100 ||
        (requested % 5) != 0 || (limit % 5) != 0) {
        return;
    }
    const uint8_t sequence = static_cast<uint8_t>(jsonInteger(input, "request_id", 0));
    const uint8_t strength = static_cast<uint8_t>(requested);
    const uint8_t maximum = static_cast<uint8_t>(limit);
    const uint8_t flags = jsonBoolean(input, "tv_enable", true) ? DJY_UART_TV_FLAG_ENABLE : 0u;
    const bool commandChanged = !liveCommandSeen || liveCommand.sequence != sequence ||
                                liveCommand.strength_percent != strength ||
                                liveCommand.limit_percent != maximum || liveCommand.flags != flags;
    liveCommand.sequence = sequence;
    liveCommand.strength_percent = strength;
    liveCommand.limit_percent = maximum;
    liveCommand.flags = flags;
    liveCommandSeen = true;
    liveCommandMs = millis();
    state.tvRequested = liveCommand.strength_percent;
    state.tvLimit = liveCommand.limit_percent;
    if (commandChanged) state.configAck = false;
}

void forwardLiveTvCommand() {
    if (EV_RECEIVE_ONLY) return;
    static uint32_t previous = 0u;
    const uint32_t now = millis();
    if (!rearUartReady || !liveCommandSeen || now - liveCommandMs > 500u ||
        state.rearExtendedMs == 0u || now - state.rearExtendedMs >= 300u ||
        now - previous < 100u) {
        return;
    }
    previous = now;
    uint8_t frame[DJY_UART_LIVE_TV_SIZE];
    djy_uart_pack_live_tv(frame, &liveCommand);
    rearUart.write(frame, sizeof(frame));
}

void handleCommand(const String& input) {
    if (EV_RECEIVE_ONLY) return;
    if (jsonStringEquals(input, "type", "live_tv")) {
        acceptLiveTvCommand(input);
    } else if (jsonStringEquals(input, "type", "pit_config")) {
        sendPitConfig(input);
    }
}

void receiveCommands() {
    int length = commandUdp.parsePacket();
    if (length > 0 && length < 512) {
        const bool trustedPit = commandUdp.remoteIP() == pitHost;
        String input;
        input.reserve(length);
        while (commandUdp.available()) input += static_cast<char>(commandUdp.read());
        if (trustedPit) handleCommand(input);
    }
    if (Serial.available()) {
        String input = Serial.readStringUntil('\n');
        handleCommand(input);
    }
#if EV_RELAY_ENABLED && EV_RELAY_ACCEPT_COMMANDS
    char pending[sizeof(relayCommand)] = {};
    bool available = false;
    portENTER_CRITICAL(&relayMux);
    if (relayCommandPending) {
        strlcpy(pending, relayCommand, sizeof(pending));
        relayCommandPending = false;
        available = true;
    }
    portEXIT_CRITICAL(&relayMux);
    if (available) handleCommand(String(pending));
#endif
}

void publishTelemetry() {
    static uint32_t previous = 0;
    // Every Rear record is published immediately. With no Rear input, retain
    // a 1 Hz heartbeat; Rear frames and BMS power replies each keep every event.
    if (!rearSamplePending && !bmsSamplePending && millis() - previous < (EV_REAR_UART_MODE ? 1000u : 200u)) return;
    const char* sampleKind = rearSamplePending ? "rear" : bmsSamplePending ? "bms" : "heartbeat";
    rearSamplePending = false;
    bmsSamplePending = false;
    previous = millis();
    ++state.sequence;
    const bool driverFresh = state.driverMs != 0u && millis() - state.driverMs < 200u;
    const bool rearFresh = state.rearMs != 0u && millis() - state.rearMs < 300u;
    const bool rearOutputFresh = rearFresh && state.rearExtendedMs != 0u &&
                                 millis() - state.rearExtendedMs < 300u;
    const bool tqvInternalFresh = rearFresh && state.tqvInternalMs != 0u &&
                                  millis() - state.tqvInternalMs < 300u;
    const bool sasFresh = state.sasMs != 0u && millis() - state.sasMs < 200u;
    const bool tpsFresh = state.tpsMs != 0u && millis() - state.tpsMs < 300u;
    // tv_stm_esp: TPS_ADC_MIN/MAX=885/2820, margin=200.
    const bool tpsOk = tpsFresh && state.tpsRaw >= 685u && state.tpsRaw <= 3020u;
    const bool frontFresh = rearOutputFresh && state.fault != 1u;
    const bool rpmLeftOk = rearFresh && (EV_REAR_UART_MODE ? state.rpmLeftValid : state.rpmLeft != 0u);
    const bool rpmRightOk = rearFresh && (EV_REAR_UART_MODE ? state.rpmRightValid : state.rpmRight != 0u);
    const char* rpmLeftQuality = !rearFresh ? "NO_DATA" : rpmLeftOk ? "OK" :
        state.captureLeft == 0u ? "NO_PULSES" : state.glitchLeft > 0u ? "NOISY" : "UNVERIFIED";
    const char* rpmRightQuality = !rearFresh ? "NO_DATA" : rpmRightOk ? "OK" :
        state.captureRight == 0u ? "NO_PULSES" : state.glitchRight > 0u ? "NOISY" : "UNVERIFIED";
    const float sasRelative = sasFresh ? sasRelativeDeg() : 0.0f;
    const bool tvLimited = state.tvApplied + 1u < state.tvRequested;
    const bool regenReady = (state.rearFlags & DJY_REAR_STATUS_REGEN_READY) != 0;
    const char* reason = EV_REAR_UART_MODE && EV_RECEIVE_ONLY ?
                         (!rearFresh ? "REAR_STATUS_TIMEOUT" : state.fault ? "STM_FAULT" : "NONE") :
                         EV_REAR_UART_MODE && !driverFresh ? "PIT_CONTROL_TIMEOUT" :
                         !driverFresh ? "DRIVER_CONTROL_TIMEOUT" :
                         !rearFresh ? "REAR_STATUS_TIMEOUT" :
                         (!regenReady && state.regenRequested > 0) ? "REGEN_INTERFACE_UNVALIDATED" :
                         tvLimited ? "PIT_LIMIT_OR_RAMP" : "NONE";

