20233332choi/DJY_EvTLMT/firmware/esp32_ev_gateway/src/main.cpp
    const bool bmsOnline = bms.lastRxMs != 0u && millis() - bms.lastRxMs < 2000u;
    bool bmsFault = false;
    char alarmHex[17] = {};
    char cellsJson[512] = "[";
    size_t cellsLength = 1;
    bool firstCell = true;
    for (uint8_t i = 0; i < 8; ++i) {
        bmsFault = bmsFault || bms.alarm[i] != 0;
        snprintf(alarmHex + i * 2u, sizeof(alarmHex) - i * 2u, "%02X", bms.alarm[i]);
    }
    for (uint8_t i = 0; i < bms.cellCount; ++i) {
        if (!bms.cellSeen[i]) continue;
        const int written = snprintf(cellsJson + cellsLength, sizeof(cellsJson) - cellsLength,
                                     "%s%.3f", firstCell ? "" : ",", bms.cells[i]);
        if (written <= 0 || static_cast<size_t>(written) >= sizeof(cellsJson) - cellsLength) break;
        cellsLength += static_cast<size_t>(written);
        firstCell = false;
    }
    strlcat(cellsJson, "]", sizeof(cellsJson));
    const char* bmsState = bms.state == 1 ? "CHARGING" : bms.state == 2 ? "DISCHARGING" :
                           bms.state == 0 ? "STANDBY" : "UNKNOWN";

    uint32_t relayTx = 0, relayErrors = 0, relayCommands = 0;
    int relayHttpStatus = 0, relayDns = 0, relayTcp443 = 0, relayTls = 0;
#if EV_RELAY_ENABLED
    portENTER_CRITICAL(&relayMux);
    relayTx = relayTxCount;
    relayErrors = relayErrorCount;
    relayCommands = relayCommandCount;
    relayHttpStatus = relayLastHttpStatus;
    relayDns = relayDnsStatus;
    relayTcp443 = relayTcp443Status;
    relayTls = relayTlsError;
    portEXIT_CRITICAL(&relayMux);
#endif
    char json[kTelemetryJsonSize];
    char timingJson[256];
    if(!state.timing.json(timingJson,sizeof(timingJson)))return;
    // Compact metadata: version, seq, clock hi/lo (us), STM skips, RX gaps,
    // duplicate frames, observed clock regressions. Existing timestamp_ms
    // remains the ESP clock required by the HTTPS batching contract.
    char sampleJson[128] = "null";
    if (state.rearBinarySeen) {
        const int n = snprintf(sampleJson, sizeof(sampleJson), "[1,%lu,%lu,%lu,%lu,%lu,%lu,%lu]",
            (unsigned long)state.rearSampleSequence,
            (unsigned long)(state.rearSnapshotUs >> 32), (unsigned long)(uint32_t)state.rearSnapshotUs,
            (unsigned long)state.rearTxSkipped, (unsigned long)state.rearMissingSamples,
            (unsigned long)state.rearDuplicateSamples, (unsigned long)state.rearClockResets);
        if (n < 0 || (size_t)n >= sizeof(sampleJson)) return;
    }
    int jsonLength = snprintf(json, sizeof(json),
        "{\"rear_sample\":%s,\"board_timing\":%s,\"seq\":%lu,\"timestamp_ms\":%lu,\"rpm_left\":%u,\"rpm_right\":%u,"
        "\"rpm_left_reported\":%u,\"rpm_right_reported\":%u,\"rpm_left_reported_online\":%s,\"rpm_right_reported_online\":%s,"
        "\"rpm_left_quality\":\"%s\",\"rpm_right_quality\":\"%s\","
        "\"cap_left\":%lu,\"cap_right\":%lu,\"rpm_glitch_left\":%lu,\"rpm_glitch_right\":%lu,"
        "\"rear_desync_left\":%lu,\"rear_desync_right\":%lu,"
        "\"rpm_left_online\":%s,\"rpm_right_online\":%s,\"motor_left_ok\":%s,\"motor_right_ok\":%s,"
        "\"speed_kmh\":%.2f,\"speed_online\":%s,\"tps_raw\":%u,\"tps_pct\":%.2f,\"tps_online\":%s,\"tps_ok\":%s,\"dac_left\":%u,\"dac_right\":%u,"
        "\"sas_raw\":%u,\"sas_center_raw\":%u,\"sas_absolute_deg\":%.3f,"
        "\"sas_relative_deg\":%.3f,\"sas_deg\":%.3f,\"sas_online\":%s,\"sas_ok\":%s,\"front_sensor_online\":%s,\"front_source\":\"FRONT CAN / REAR UART\","
        "\"tv_requested_pct\":%u,\"tv_applied_pct\":%u,\"regen_requested_pct\":%u,\"regen_applied_pct\":%u,"
        "\"tv_limit_pct\":%u,\"regen_limit_pct\":%u,\"tv_ramp_pct_s\":%u,\"regen_ramp_pct_s\":%u,"
        "\"drive_mode\":%u,\"driver_control_seq\":%u,\"rear_status_seq\":%u,\"config_seq\":%u,\"config_ack\":%s,"
        "\"driver_control_fresh\":%s,\"tv_active\":%s,\"ed_active\":%s,\"regen_ready\":%s,\"regen_active\":%s,"
        "\"tv_limited\":%s,\"regen_limited\":%s,\"pit_adjust_allowed\":%s,"
        "\"can_ok\":%s,\"uart_ok\":%s,\"stm_online\":%s,\"imu_ok\":%s,\"imu_online\":%s,\"yaw_rate_rad_s\":%.3f,\"lateral_accel_m_s2\":%.3f,\"longitudinal_accel_m_s2\":%.3f,\"imu_raw_ax_m_s2\":%.3f,\"imu_raw_ay_m_s2\":%.3f,\"imu_raw_az_m_s2\":%.3f,"
        "\"rear_output_online\":%s,\"tqv_internal_online\":%s,"
        "\"pid_kp\":%.3f,\"pid_ki\":%.3f,\"pid_kd\":%.3f,\"pid_online\":%s,"
        "\"vehicle_speed_m_s\":%.3f,\"desired_yaw_rad_s\":%.3f,\"yaw_error_rad_s\":%.3f,\"delta_power_kw\":%.3f,\"power_left_kw\":%.3f,\"power_right_kw\":%.3f,\"traction_scale\":%.3f,\"fault_code\":%u,"
        "\"rear_uart_rx\":%lu,\"rear_uart_errors\":%lu,\"rear_uart_bytes\":%lu,\"rear_rx_high\":%lu,\"rear_rx_low\":%lu,\"rear_command_rx\":%lu,\"rear_command_errors\":%lu,"
        "\"stm_can_rx\":%lu,\"stm_can_errors\":%lu,\"stm_can_status\":%lu,"
        "\"stm_imu_diag_0\":%lu,\"stm_imu_diag_1\":%lu,\"stm_imu_diag_2\":%lu,\"stm_imu_diag_3\":%lu,\"limit_reason\":\"%s\","
        "\"command_source\":\"%s\",\"live_control_allowed\":%s,"
        "\"wifi_connected\":%s,\"wifi_status_code\":%d,\"wifi_reconnect_attempts\":%lu,\"wifi_rssi_dbm\":%ld,\"internet_relay_enabled\":%s,"
        "\"internet_relay_tx\":%lu,\"internet_relay_errors\":%lu,\"internet_relay_commands\":%lu,"
        "\"internet_relay_last_http_status\":%d,\"internet_relay_dns_ok\":%d,"
        "\"internet_relay_tcp443_ok\":%d,\"internet_relay_tls_error\":%d}",
        sampleJson,timingJson,static_cast<unsigned long>(state.sequence), static_cast<unsigned long>(millis()),
        state.rpmLeft, state.rpmRight,
        state.rpmLeft, state.rpmRight, rearFresh ? "true" : "false", rearFresh ? "true" : "false",
        rpmLeftQuality, rpmRightQuality,
        static_cast<unsigned long>(state.captureLeft), static_cast<unsigned long>(state.captureRight),
        static_cast<unsigned long>(state.glitchLeft), static_cast<unsigned long>(state.glitchRight),
        static_cast<unsigned long>(state.desyncLeft), static_cast<unsigned long>(state.desyncRight),
        rpmLeftOk ? "true" : "false", rpmRightOk ? "true" : "false",
        rpmLeftOk ? "true" : "false", rpmRightOk ? "true" : "false",
        speedKmh(), (rpmLeftOk && rpmRightOk && (!EV_REAR_UART_MODE || tqvInternalFresh)) ? "true" : "false",
        state.tpsRaw, throttlePercent(),
        (tpsFresh && frontFresh) ? "true" : "false",
        (tpsOk && frontFresh && state.fault != 2u) ? "true" : "false",
        state.dacLeft, state.dacRight,
        state.sasRaw, state.sasCenterRaw, state.sasRaw * (360.0f / 16384.0f),
        (static_cast<int>(state.sasRaw) - state.sasCenterRaw) * (360.0f / 16384.0f),
        state.steeringRad * (180.0f / PI),
        (rearFresh && frontFresh && state.sasValid) ? "true" : "false",
        (rearFresh && frontFresh && state.sasValid) ? "true" : "false",
        frontFresh ? "true" : "false",
        state.tvRequested, state.tvApplied, state.regenRequested, state.regenApplied,
        state.tvLimit, state.regenLimit, state.tvRamp, state.regenRamp,
        state.driveMode, state.driverSequence, state.rearSequence, state.configSequence, state.configAck ? "true" : "false",
        driverFresh ? "true" : "false", (state.rearFlags & DJY_REAR_STATUS_TV_ACTIVE) ? "true" : "false",
        state.edActive ? "true" : "false", regenReady ? "true" : "false", state.regenApplied > 0 ? "true" : "false",
        tvLimited ? "true" : "false", state.regenApplied + 1u < state.regenRequested ? "true" : "false",
        pitAllowed() ? "true" : "false", (!EV_REAR_UART_MODE && driverFresh && rearFresh) ? "true" : "false",
        (EV_REAR_UART_MODE && rearFresh) ? "true" : "false",
        rearFresh ? "true" : "false", (rearFresh && state.imuValid) ? "true" : "false", (rearFresh && state.imuValid) ? "true" : "false",
        state.yawRateRadS, state.lateralAccelMS2, state.longitudinalAccelMS2,
        state.imuRawAx, state.imuRawAy, state.imuRawAz,
        rearOutputFresh ? "true" : "false", tqvInternalFresh ? "true" : "false",
        state.pidKp, state.pidKi, state.pidKd,
        (rearFresh && state.pidMs != 0u && millis() - state.pidMs < 300u) ? "true" : "false",
        state.vehicleSpeedMS, state.desiredYawRadS, state.yawErrorRadS,
        state.deltaPowerKw, state.powerLeftKw, state.powerRightKw, state.tractionScale, state.fault,
        static_cast<unsigned long>(state.rearUartRx), static_cast<unsigned long>(state.rearUartErrors),
        static_cast<unsigned long>(state.rearUartBytes),
        static_cast<unsigned long>(state.rearRxHigh), static_cast<unsigned long>(state.rearRxLow),
        static_cast<unsigned long>(state.rearCommandRx), static_cast<unsigned long>(state.rearCommandErrors),
        static_cast<unsigned long>(state.stmCanRx), static_cast<unsigned long>(state.stmCanErrors),
        static_cast<unsigned long>(state.stmCanStatus),
        static_cast<unsigned long>(state.stmImuDiag0), static_cast<unsigned long>(state.stmImuDiag1),
        static_cast<unsigned long>(state.stmImuDiag2), static_cast<unsigned long>(state.stmImuDiag3), reason,
        (EV_REAR_UART_MODE && driverFresh) ? "PIT" : "WHEEL",
        (!EV_RECEIVE_ONLY && EV_REAR_UART_MODE && rearFresh && state.rearExtendedMs != 0u &&
         millis() - state.rearExtendedMs < 300u) ? "true" : "false",
        WiFi.status() == WL_CONNECTED ? "true" : "false",
        static_cast<int>(WiFi.status()), static_cast<unsigned long>(wifiReconnectAttempts),
        WiFi.status() == WL_CONNECTED ? static_cast<long>(WiFi.RSSI()) : -127L,
        EV_RELAY_ENABLED ? "true" : "false",
        static_cast<unsigned long>(relayTx), static_cast<unsigned long>(relayErrors),
        static_cast<unsigned long>(relayCommands), relayHttpStatus, relayDns, relayTcp443, relayTls);
    if (jsonLength < 0 || static_cast<size_t>(jsonLength) >= sizeof(json)) return;
    const int bmsJsonLength = snprintf(json + jsonLength - 1, sizeof(json) - static_cast<size_t>(jsonLength) + 1,
        ",\"bms_online\":%s,\"bms_ok\":%s,\"bms_fault\":%s,\"bms_source\":\"ESP CAN\","
        "\"bms_model\":\"DALY R24TS\",\"bms_protocol\":\"DALY CAN 250k\",\"bms_state\":\"%s\","
        "\"bms_age_ms\":%lu,\"battery_pack_voltage_v\":%.1f,\"battery_current_a\":%.1f,"
        "\"battery_power_kw\":%.3f,\"battery_soc_pct\":%.1f,\"bms_life_pct\":%u,"
        "\"bms_remaining_capacity_ah\":%.3f,\"bms_cell_count\":%u,\"bms_temp_count\":%u,"
        "\"bms_max_cell_voltage_v\":%.3f,\"bms_min_cell_voltage_v\":%.3f,"
        "\"bms_max_cell_number\":%u,\"bms_min_cell_number\":%u,\"bms_cell_delta_mv\":%.1f,"
        "\"bms_temp_max_c\":%.1f,\"bms_temp_min_c\":%.1f,\"bms_cycle_count\":%u,"
        "\"bms_charge_mos_on\":%s,\"bms_discharge_mos_on\":%s,\"bms_charger_present\":%s,"
        "\"bms_load_present\":%s,\"bms_balancing\":%s,\"bms_alarm_hex\":\"%s\","
        "\"bms_alarm_summary\":\"%s\",\"bms_cell_voltages_v\":%s,"
        "\"bms_power_timing\":[1,%lu,%lu,%lu,%lld,%lu,%lu,%lu],\"sample_kind\":\"%s\"}",
        bmsOnline ? "true" : "false", bmsOnline && !bmsFault ? "true" : "false",
        bmsFault ? "true" : "false", bmsState,
        bmsOnline ? static_cast<unsigned long>(millis() - bms.lastRxMs) : 0ul,
        bms.voltage, bms.current, bms.voltage * bms.current / 1000.0f, bms.soc, bms.life,
        bms.remainingAh, bms.cellCount, bms.tempCount, bms.maxCell, bms.minCell,
        bms.maxCellNumber, bms.minCellNumber, (bms.maxCell - bms.minCell) * 1000.0f,
        bms.maxTemp, bms.minTemp, bms.cycleCount,
        bms.chargeMos ? "true" : "false", bms.dischargeMos ? "true" : "false",
        bms.charger ? "true" : "false", bms.load ? "true" : "false",
        bms.balancing ? "true" : "false", alarmHex, bmsFault ? "ALARM" : "NONE", cellsJson,
        static_cast<unsigned long>(bms.powerRequestCount), static_cast<unsigned long>(bms.powerTxErrors),
        static_cast<unsigned long>(bms.powerRxCount),
        bms.powerSeen ? static_cast<long long>(static_cast<uint32_t>(millis() - bms.powerLastRxMs)) : -1LL,
        static_cast<unsigned long>(bms.powerRxIntervalMs), static_cast<unsigned long>(bms.powerMaxRxIntervalMs),
        static_cast<unsigned long>(bms.powerMaxRequestIntervalMs), sampleKind);
    if (bmsJsonLength < 0 || static_cast<size_t>(bmsJsonLength) >= sizeof(json) - static_cast<size_t>(jsonLength) + 1u) return;
    jsonLength += bmsJsonLength - 1;  // BMS fields replace the original closing brace.

    if (EV_LOCAL_UDP_ENABLED && WiFi.status() == WL_CONNECTED) {
        // NetworkUDP::write() auto-flushes every 1460 bytes as a NEW datagram,
        // splitting this JSON into independently invalid messages. Native UDP
        // sends one datagram; IP fragmentation/reassembly stays below the app.
        if (telemetrySocket < 0) telemetrySocket = socket(AF_INET, SOCK_DGRAM, IPPROTO_UDP);
        if (telemetrySocket >= 0) {
            sockaddr_in target = {};
            target.sin_family = AF_INET;
            target.sin_port = htons(EV_TELEMETRY_PORT);
            target.sin_addr.s_addr = static_cast<uint32_t>(pitHost);
            const int sent = sendto(telemetrySocket, json, static_cast<size_t>(jsonLength), MSG_DONTWAIT,
                                    reinterpret_cast<const sockaddr*>(&target), sizeof(target));
            if (sent != jsonLength) {
                close(telemetrySocket);
                telemetrySocket = -1;
            }
        }
    }
#if EV_RELAY_ENABLED
    stageRelayTelemetry(json);
#endif
    // Queue USB debug at 1 Hz; never block UART reception for a 3 KB JSON.
    static uint32_t lastUsbMs = 0;
    if (millis() - lastUsbMs >= 1000u && Serial.availableForWrite() >= jsonLength + 2) {
        Serial.println(json);
        lastUsbMs = millis();
    }
    state.configAck = false;
}

}  // namespace

void setup() {
    Serial.setTxBufferSize(4096);
    Serial.begin(115200);
    Serial.setTimeout(10);
    Serial.println("# DJY ESP gateway boot");
    runStatusLedSelfTest();
    pinMode(EV_PIT_ENABLE_GPIO, INPUT_PULLUP);

    if (EV_REAR_UART_MODE) {
        const uint32_t rearBaud = EV_REAR_UART_BINARY ? DJY_TELEMETRY_BAUD : 115200u;
        rearUart.setRxBufferSize(2048); // Holds eight complete 238-byte binary frames.
        rearUart.begin(rearBaud, SERIAL_8N1, EV_REAR_UART_RX_GPIO, EV_REAR_UART_TX_GPIO);
        rearUartReady = static_cast<bool>(rearUart);
        Serial.printf("# Rear UART ready=%u RX GPIO%d TX GPIO%d, %lu 8N1, %s, receive_only=%u\n",
                      rearUartReady, EV_REAR_UART_RX_GPIO, EV_REAR_UART_TX_GPIO,
                      (unsigned long)rearBaud, EV_REAR_UART_BINARY ? "binary" : "ASCII", EV_RECEIVE_ONLY);
#if EV_BMS_CAN_ENABLED
        const twai_general_config_t general = TWAI_GENERAL_CONFIG_DEFAULT(
            static_cast<gpio_num_t>(EV_BMS_CAN_TX_GPIO), static_cast<gpio_num_t>(EV_BMS_CAN_RX_GPIO), TWAI_MODE_NORMAL);
        const twai_timing_config_t timing = TWAI_TIMING_CONFIG_250KBITS();
        const twai_filter_config_t filter = TWAI_FILTER_CONFIG_ACCEPT_ALL();
        if (twai_driver_install(&general, &timing, &filter) == ESP_OK)
            bmsCanReady = twai_start() == ESP_OK;
        Serial.printf("# DALY CAN ready=%u TX GPIO%d RX GPIO%d 250kbps extended read-only\n",
                      bmsCanReady, EV_BMS_CAN_TX_GPIO, EV_BMS_CAN_RX_GPIO);
#endif
    } else {
        const twai_general_config_t general = TWAI_GENERAL_CONFIG_DEFAULT(
            static_cast<gpio_num_t>(EV_CAN_TX_GPIO), static_cast<gpio_num_t>(EV_CAN_RX_GPIO), TWAI_MODE_NORMAL);
        const twai_timing_config_t timing = TWAI_TIMING_CONFIG_500KBITS();
        const twai_filter_config_t filter = TWAI_FILTER_CONFIG_ACCEPT_ALL();
        if (twai_driver_install(&general, &timing, &filter) == ESP_OK) {
            canReady = twai_start() == ESP_OK;
        }
        Serial.println(canReady ? "# CAN ready" : "# CAN unavailable");
    }

    WiFi.mode(WIFI_STA);
    WiFi.setSleep(false);
    WiFi.setAutoReconnect(true);
    WiFi.begin(EV_WIFI_SSID, EV_WIFI_PASSWORD);
    wifiLastReconnectMs = millis();
    pitHost.fromString(EV_PIT_HOST);
    commandUdp.begin(EV_COMMAND_PORT);
    setStatusLed(0, 0, 64);
#if EV_RELAY_ENABLED
    xTaskCreatePinnedToCore(relayTask, "ev-https-relay", 12288, nullptr, 0, nullptr, 0);
#endif
    Serial.println("# DJY ESP gateway ready");
}

void loop() {
    if (rearUartReady) receiveRearUart();
    else receiveCan();
    receiveBmsCan();
    receiveCommands();
    forwardLiveTvCommand();
    sendEspStatus();
    maintainWifi();
    updateStatusLed();
    publishTelemetry();
    delay(1);
}
